# alien.py
# ------------------------------------------------------------------------------
# 字典类似于labview中的簇
# 字典由键值对组成
# 键值对：（字符串形式的键名：相应的值【可以是任意数值类型】）
# 字典的格式
# dic = {'key1':value, 'key2':value, ......}
# 相关的操作有什么？

# 1. 创建
alien_0 = {'color':'green','points':5}
# 2. 读取
# 2.1 ‘[]’方式读取，若字典中无相应键值则程序报错，中断执行
print(alien_0['color'])
print(alien_0['points'])
# 2.2 get()方法读取,若字典中无相应键值则默认返回None
print(alien_0.get('key',"查无此键"))
# ------------------------------------------------------------------------------
# 3. 写入（修改）
# 将字典中的键值当作变量，进行直接赋值后会自动加入字典
# 将已存在的键值对继续向字典中添加时，新键值对会对其进行覆盖操作，结合添加功能，可以看作是对键值对的修改操作
alien_0['x_position'] = 0
alien_0['y_position'] = 25
print(alien_0)
# 4. 删除
del alien_0['points']
print(alien_0)

# 字典本身有什么方法？(字典名.进行查看)
print (alien_0.values())